In [1]:
# project idea note
# https://docs.google.com/document/d/1_Tp3DhT_5sD2-RbuMpkKVjSKfcNsOQAvUdDc6ZCoJtc/edit?usp=sharing

# new data set link ----  
#https://www.kaggle.com/valentinjoseph/avocado-sales-20152021-us-centric (no code)

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime
import numpy as np
%matplotlib inline
import os

from library.sb_utils import save_file

In [3]:
data = pd.read_csv('avocado cleaned.csv')

#### Inspction of the dataframe

In [4]:
data.head(2)

,Date,AveragePrice,TotalVolume,plu4046,plu4225,plu4770,TotalBags,SmallBags,LargeBags,XLargeBags,type,year,region
0,1/4/2015,1.22,40873.28,2819.50,28287.42,49.9,9716.46,9186.93,529.53,0.0,conventional,2015,Albany
1,1/4/2015,1.79,1373.95,57.42,153.88,0.0,1162.65,1162.65,0.00,0.0,organic,2015,Albany

In [5]:
data.shape

(41025, 13)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41025 entries, 0 to 41024
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          41025 non-null  object
 1   AveragePrice  41025 non-null  float64
 2   TotalVolume   41025 non-null  float64
 3   plu4046       41025 non-null  float64
 4   plu4225       41025 non-null  float64
 5   plu4770       41025 non-null  float64
 6   TotalBags     41025 non-null  float64
 7   SmallBags     41025 non-null  float64
 8   LargeBags     41025 non-null  float64
 9   XLargeBags    41025 non-null  float64
 10  type          41025 non-null  object
 11  year          41025 non-null  int64
 12  region        41025 non-null  object
dtypes: float64(9), int64(1), object(3)
memory usage: 4.1+ MB

In [7]:
# check for missing value
data.isnull().sum()

Date            0
AveragePrice    0
TotalVolume     0
plu4046         0
plu4225         0
plu4770         0
TotalBags       0
SmallBags       0
LargeBags       0
XLargeBags      0
type            0
year            0
region          0
dtype: int64

In [8]:
# check for duplicate
data.duplicated().sum()

0

In [9]:
data.nunique()

Date              361
AveragePrice    24331
TotalVolume     40959
plu4046         38786
plu4225         39738
plu4770         24862
TotalBags       40751
SmallBags       21682
LargeBags       17450
XLargeBags       7356
type                4
year                7
region             61
dtype: int64

#the typpe of avocado is 2, but we have 4

In [10]:
data.type.unique()

array(['conventional', 'organic', 'Conventional', 'Organic'], dtype=object)

In [11]:
# rename 
data['type'] = data['type'].replace(['Conventional'],'conventional')
data['type'] = data['type'].replace(['Organic'],'organic')

In [12]:
# check year 
data.year.unique()

array([2015, 2016, 2017, 2018, 2019, 2020, 2021], dtype=int64)

In [13]:
data.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'BirminghamMontgomery',
       'Boise', 'Boston', 'BuffaloRochester', 'California', 'Charlotte',
       'Chicago', 'CincinnatiDayton', 'Columbus', 'DallasFtWorth',
       'Denver', 'Detroit', 'GrandRapids', 'GreatLakes',
       'HarrisburgScranton', 'HartfordSpringfield', 'Houston',
       'Indianapolis', 'Jacksonville', 'LasVegas', 'LosAngeles',
       'Louisville', 'Miami', 'Midsouth', 'Nashville', 'New York',
       'NewOrleans', 'NewYork', 'Northeast', 'Northern New England',
       'NorthernNewEngland', 'Orlando', 'PeoriaSpringfield',
       'Philadelphia', 'PhoenixTucson', 'Pittsburgh', 'Plains',
       'Portland', 'Providence', 'RaleighGreensboro', 'RichmondNorfolk',
       'Roanoke', 'Sacramento', 'SanDiego', 'SanFrancisco', 'Seattle',
       'SouthCarolina', 'SouthCentral', 'Southeast', 'Spokane', 'StLouis',
       'Syracuse', 'Tampa', 'Toledo', 'TotalUS', 'West',
       'WestTexNewMexico', 'Wichita'], dtype=object)

In [14]:
# rename  New York
data['region'] = data['region'].replace(['New York'],'NewYork')

#northeast region states
#Maine, New Hampshire, Vermont, Massachusetts, Rhode Island, Connecticut, New York, New Jersey, and Pennsylvania

In [15]:
# set the date as datetime and set as index
data['Date']=pd.to_datetime(data['Date'])
data.set_index("Date", inplace=True)

In [16]:
# select features of interest
df= data[['AveragePrice', 'TotalVolume', 'type', 'year','region']]

In [17]:
#subset dataset to get TotalUS and Northeast region and New York
# Total_US_avocado_dataset
df_us = df[df['region']=='TotalUS']
df_us_org=df_us[df_us['type']=='organic']
df_us_con=df_us[df_us['type']=='conventional']
# northeast region states(#Maine, New Hampshire, Vermont, 
# Massachusetts, Rhode Island, Connecticut, New York, New Jersey, and Pennsylvania)
df_ne = df[df['region']=='Northeast']
df_ne_org=df_ne[df_ne['type']=='organic']
df_ne_con=df_ne[df_ne['type']=='conventional']
# New_york_avocado_dataset
df_ny = df[df['region']=='NewYork']
#df_ny_org=df_ny[df_ny['type']=='organic']
#df_ny_con=df_ny[df_ny['type']=='conventional']

In [18]:
# filter out subtotals (total us, west, midsouth, northeast, south central and southeast)
df = df.loc[df['region'] != 'TotalUS']
df = df.loc[df['region'] != 'Northeast']
df = df.loc[df['region'] != 'Midsouth']
df = df.loc[df['region'] != 'SouthCentral']
df = df.loc[df['region'] != 'Southeast']
df = df.loc[df['region'] != 'Northern New England']
df = df.loc[df['region'] != 'NorthernNewEngland']
df = df.loc[df['region'] != 'WestTexNewMexico']
df = df.loc[df['region'] != 'West']

In [19]:
df.head()

            AveragePrice  TotalVolume          type  year  region
Date
2015-01-04          1.22     40873.28  conventional  2015  Albany
2015-01-04          1.79      1373.95       organic  2015  Albany
2015-01-11          1.24     41195.08  conventional  2015  Albany
2015-01-11          1.77      1182.56       organic  2015  Albany
2015-01-18          1.17     44511.28  conventional  2015  Albany

In [20]:
df_us.head(2)

            AveragePrice  TotalVolume          type  year   region
Date
2015-01-04          0.95  31324277.73  conventional  2015  TotalUS
2015-01-04          1.46    612910.15       organic  2015  TotalUS

In [21]:
df_ne.head(2)

            AveragePrice  TotalVolume          type  year     region
Date
2015-01-04          1.09   3759282.62  conventional  2015  Northeast
2015-01-04          1.88     48280.46       organic  2015  Northeast

In [22]:
df_ny.head(2)

            AveragePrice  TotalVolume          type  year   region
Date
2018-01-08      1.714335   1106124.45  conventional  2018  NewYork
2018-01-08      2.225827     57337.41       organic  2018  NewYork

In [23]:
df_ny.year.unique()

array([2018, 2019, 2020, 2021, 2015, 2016, 2017], dtype=int64)

In [24]:
df_ny.reset_index(inplace=True)
df_ny = df_ny.sort_values(by='Date', ascending=True)
df_ny.set_index('Date', inplace=True)
df_ny.head()

            AveragePrice  TotalVolume          type  year   region
Date
2015-01-04          1.93     17328.24       organic  2015  NewYork
2015-01-04          1.09   1402890.20  conventional  2015  NewYork
2015-01-11          1.34   1018225.83  conventional  2015  NewYork
2015-01-11          2.03     14817.97       organic  2015  NewYork
2015-01-18          1.37   1044280.56  conventional  2015  NewYork

In [25]:
df_ny_org=df_ny[df_ny['type']=='organic']
df_ny_con=df_ny[df_ny['type']=='conventional']

## Save data

In [26]:
df = df.reset_index()
df_us = df_us.reset_index()
df_ne = df_ne.reset_index()
df_ny = df_ny.reset_index()

In [27]:
datapath = './data'
save_file(df, 'df.csv', datapath)

A file already exists with this name.

Do you want to overwrite? (Y/N)y
Writing file.  "./data\df.csv"

In [28]:
save_file(df_us, 'df_us.csv', datapath)

A file already exists with this name.

Do you want to overwrite? (Y/N)y
Writing file.  "./data\df_us.csv"

In [29]:
save_file(df_ne, 'df_ne.csv', datapath)

A file already exists with this name.

Do you want to overwrite? (Y/N)y
Writing file.  "./data\df_ne.csv"

In [30]:
save_file(df_ny, 'df_ny.csv', datapath)

A file already exists with this name.

Do you want to overwrite? (Y/N)y
Writing file.  "./data\df_ny.csv"